docx_generate = ["문서 4종 생성해줘",
  "문서 4종 만들어줘", "4가지 문서 생성해줘", "문서 4종류 만들어 줄래?", "4가지 문서를 만들어줘",
  "문서 네 가지 만들어 줄 수 있어?", "문서 4종 준비해줘", "네 가지 문서를 작성해줘",
  "문서 4종류를 생성할 수 있어?", "4개의 문서 만들어줘", "문서 4종 작성해줘",
  "4개의 다른 문서를 만들어줄래?", "문서 네 종류 만들어봐", "4종류의 문서를 생성해줄 수 있니?",
  "문서 4가지 만들어주세요", "문서 네 개 만들어 줄 수 있니?", "문서 4종류를 작성해줘",
  "4종류 문서 만들기", "4가지 문서를 작성해 줄래?", "문서 네 종류를 준비해줄 수 있어?",
  "문서 4가지 준비해줘"
]
# search_db = ["DB 검색해줘",
#   "데이터베이스 검색해줘", "DB 조회해줘", "DB에서 정보 찾아줘", "데이터베이스에서 검색해줘",
#   "DB에서 데이터 찾아줘", "데이터베이스를 조회해줘", "DB 정보 검색해줘", "데이터베이스 정보 찾아줘",
#   "DB 데이터 조회해줘", "DB 검색 부탁해", "데이터베이스 찾아봐줘", "DB에서 정보를 검색해줘",
#   "데이터베이스에서 자료 검색해줘", "DB에서 자료 찾아줘", "데이터베이스 정보를 검색해줘",
#   "DB를 조회해줘", "데이터베이스를 찾아봐", "DB에서 자료를 찾아줘", "데이터베이스를 검색해줘",
#   "DB 자료 검색해줘"
# ]

term_deposit_rotation_list = ["정기예금 회전시스템","정기예금","정기예금 시스템","정기예금 회전시스템 시작", "정기예금 회전시스템 실행", "정기예금 시작", "정기예금 실행", "정기예금 시스템 시작", "정기예금 시스템 실행", "예금 시스템 시작", "예금 시스템 실행", "회전예금 시스템 시작", "회전예금 시스템 실행", "정기적 예금 시작", "정기적 예금 실행", "정기 예금 프로그램 시작", "정기 예금 프로그램 실행", "예금 회전시스템 시작", "예금 회전시스템 실행", "정기적 예금 시스템 시작", "정기적 예금 시스템 실행", "정기적 예금 프로그램 시작", "정기적 예금 프로그램 실행", "예금 회전 시스템 시작", "예금 회전 시스템 실행", "정기예금 관리 시작", "정기예금 관리 실행", "예금 관리 시스템 시작", "예금 관리 시스템 실행", "정기예금 관리 시스템 시작", "정기예금 관리 시스템 실행", "예금 프로그램 시작", "예금 프로그램 실행", "정기예금 소프트웨어 시작", "정기예금 소프트웨어 실행", "예금 회전 프로그램 시작", "예금 회전 프로그램 실행", "회전 정기예금 시작", "회전 정기예금 실행", "회전 예금 시작", "회전 예금 실행", "정기 회전 예금 시작", "정기 회전 예금 실행", "정기 예금회전 시스템 시작", "정기 예금회전 시스템 실행", "정기 예금 회전시스템 시작", "정기 예금 회전시스템 실행", "예금 회전시스템 시작", "예금 회전시스템 실행", "정기적 예금시스템 시작", "정기적 예금시스템 실행", "정기적 예금 시스템 시작", "정기적 예금 시스템 실행", "예금 회전 시스템 시작", "예금 회전 시스템 실행", "정기 예금 시스템 시작", "정기 예금 시스템 실행", "정기적 예금 관리 시작", "정기적 예금 관리 실행", "정기 예금 관리 시작", "정기 예금 관리 실행", "회전 예금 시스템 시작", "회전 예금 시스템 실행"]



# one_and_one = ["일대일 미팅 검색해줘",
#   "일대일 미팅 조회해줘", "1:1 미팅 검색해줘", "일대일 미팅 찾아줘", "1:1 미팅을 검색해줘",
#   "일대일 미팅 예약 찾아줘", "일대일 미팅 스케줄 검색해줘", "1:1 미팅 스케줄을 찾아줘",
#   "일대일 미팅을 조회해줘", "1:1 미팅 일정 찾아줘", "일대일 미팅 일정 검색해줘",
#   "1:1 미팅 일정을 조회해줘", "일대일 대화 검색해줘", "일대일 미팅 예약을 찾아줘",
#   "1:1 대화 검색해줘", "일대일 대화를 찾아줘", "일대일 미팅을 찾아줘",
#   "1:1 미팅을 찾아줘", "일대일 미팅 스케줄을 조회해줘", "1:1 미팅 스케줄을 검색해줘",
#   "일대일 미팅 예약 검색해줘"
# ]

security_system = ["보안시스템 작동해줘","보안시스템","보안 시스템","보안 시스템 작동해","보안시스템 작동시켜","보안시스템 작동","보안 시스템 가동해줘","보안시스템 가동","보안 시스템 켜줘","보안 시스템 실행해","보안시스템 켜","보안 시스템 작동요청","보안시스템 가동시켜줘","보안 시스템 시작해줘","보안시스템 시작","보안 시스템 실행해줘","보안시스템 가동해","보안 시스템 작동해 주세요","보안시스템 작동부탁해","보안 시스템 작동좀","보안시스템 켜줘요","보안 시스템 가동요청","보안시스템 실행","보안 시스템 작동해 봐","보안시스템 작동 부탁","보안 시스템 켜 주실래요","보안시스템 작동해 주세요","보안 시스템 가동해 주세요","보안시스템 실행해줘","보안 시스템 작동할게요","보안시스템 가동 부탁","보안 시스템 작동 할래요","보안시스템 켜 주라","보안 시스템 작동 요청해","보안시스템 켜줘","보안 시스템 실행 요청","보안시스템 가동해 주세요","보안 시스템 켜 주세요","보안시스템 가동좀","보안 시스템 작동하자","보안시스템 가동요청","보안 시스템 가동 할래요","보안시스템 작동 부탁드립니다"]

## 반차 연차 신청 관련 리스트
vacation_system_list = ["휴가 시스템 작동해줘", "휴가 시스템", "휴가 시스템 가동해줘",
    "휴가 시스템 켜줘", "휴가 시스템 시작해줘", "휴가 시스템 실행해줘", "휴가 시스템 작동해 주세",
    "휴가 시스템 작동시켜줘", "휴가 시스템 작동 부탁해", "휴가 시스템 가동 부탁해", "휴가 시스템 켜 주세요",
    "휴가 시스템 시작해 주세요", "휴가 시스템 실행해 주세요", "휴가 시스템 작동해 주세요", "휴가 시스템 작동",
    "휴가 시스템 운영해줘", "휴가 시스템 활성화해줘", "휴가 시스템 동작해줘", "휴가 시스템 켜",
    "휴가 시스템 시작해", "휴가 시스템 실행해", "휴가 시스템 가동", "휴가 시스템 작동 요청",
    "휴가 시스템 가동 요청", "휴가 시스템 켜기", "휴가 시스템 시작하기", "휴가 시스템 실행하기",
    "휴가 시스템 작동하기", "휴가 시스템 가동하기", "휴가 시스템 켜줘요", "휴가 시스템 시작해줘요",
    "휴가 시스템 실행해줘요", "휴가 시스템 작동해줘요", "휴가 시스템 가동해줘요", "휴가 시스템 부탁해", "휴가 시스템 요청",
    "휴가 시스템 돌려줘", "휴가 시스템 작동 중", "휴가 시스템 작동 부탁드려요", "휴가 시스템 켜주세요", "휴가 시스템 시작해주세요",
    "휴가 시스템 실행해주세요", "휴가 시스템 가동해주세요", "휴가 시스템 운영해주세요", "휴가 시스템 활성화해주세요", "휴가 시스템 동작해주세요",
    "휴가 시스템 켜주세", "휴가 시스템 작동중", "휴가 시스템 작동중입니다", "휴가 시스템 가동중입니다", "휴가 시스템 실행중입니다", "휴가 시스템 활성화중입니다", "휴가 시스템 동작중입니다",
    "휴가 시스템 가동시켜줘", "휴가 시스템 돌려주세요", "휴가 시스템 돌려줘요", "휴가시스템 작동해줘",
    "휴가시스템 가동해줘", "휴가시스템 켜줘", "휴가시스템 시작해줘", "휴가시스템 실행해줘", "휴가시스템 작동해 주세",
    "휴가시스템 작동시켜줘", "휴가시스템 작동 부탁해", "휴가시스템 가동 부탁해", "휴가시스템 켜 주세요", "휴가시스템 시작해 주세요",
    "휴가시스템 실행해 주세요", "휴가시스템 작동해 주세요", "휴가시스템 작동", "휴가시스템 운영해줘", "휴가시스템 활성화해줘",
    "휴가시스템 동작해줘", "휴가시스템 켜", "휴가시스템 시작해", "휴가시스템 실행해", "휴가시스템 가동",
    "휴가시스템 작동 요청", "휴가시스템 가동 요청", "휴가시스템 켜기", "휴가시스템 시작하기", "휴가시스템 실행하기",
    "휴가시스템 작동하기", "휴가시스템 가동하기", "휴가시스템 켜줘요", "휴가시스템 시작해줘요", "휴가시스템 실행해줘요",
    "휴가시스템 작동해줘요", "휴가시스템 가동해줘요", "휴가시스템 부탁해", "휴가시스템 요청", "휴가시스템 돌려줘",
    "휴가시스템 작동 중", "휴가시스템 작동 부탁드려요", "휴가시스템 켜주세요", "휴가시스템 시작해주세요", "휴가시스템 실행해주세요",
    "휴가시스템 가동해주세요", "휴가시스템 운영해주세요", "휴가시스템 활성화해주세요", "휴가시스템 동작해주세요"
    ]

# vacation_request_list = ["휴가 신청할래", "연차 신청할래", "휴가 신청"]
# vacation_cancel_list = ["휴가 취소할래", "휴가 취소", "휴가 삭제할래", "휴가 삭제"]
# remained_vacation_list = ["남은 휴가", "남은 휴가 알려줘", "남은 휴가 조회"]
# totday_vacation_list = ["금일 휴가자", "금일 휴가", "금일 휴가자 알려줘", "오늘 휴가자", "오늘 휴가자 알려줘"]

# 로제봇 도와줘
call_slack_bot = ["로제봇 도와줘", "로제봇도와줘", "로제봇", "로제 봇 도와줘", "로제 봇도와줘", "로 제봇 도와줘", "로 제봇도와줘", "로제봇 도와", "로제봇도와", "로제 봇 도와", "로제 봇도와", "로 제봇 도와", "로 제봇도와", "로제봇 도움", "로제봇도움", "로제 봇 도움", "로제 봇도움", "로 제봇 도움", "로 제봇도움", "로제봇 도움 요청", "로제봇도움요청", "로제 봇 도움 요청", "로제 봇도움 요청", "로 제봇 도움 요청", "로 제봇도움 요청", "로제봇 도와줘요", "로제봇도와줘요", "로제 봇 도와줘요", "로제 봇도와줘요", "로 제봇 도와줘요", "로 제봇도와줘요", "로제봇 도와주세요", "로제봇도와주세요", "로제 봇 도와주세요", "로제 봇도와주세요", "로 제봇 도와주세요", "로 제봇도와주세요", "로제봇 도움 좀", "로제봇도움좀", "로제 봇 도움 좀", "로제 봇도움 좀", "로 제봇 도움 좀", "로 제봇도움 좀", "로제봇 요청", "로제봇요청", "로제 봇 요청", "로제 봇요청", "로 제봇 요청", "로 제봇요청", "로제봇 부탁해", "로제봇부탁해", "로제 봇 부탁해", "로제 봇부탁해", "로 제봇 부탁해", "로 제봇부탁해", "로제봇 부탁드립니다", "로제봇부탁드립니다", "로제 봇 부탁드립니다", "로제 봇부탁드립니다", "로 제봇 부탁드립니다", "로 제봇부탁드립니다", "로제봇 요청해", "로제봇요청해", "로제 봇 요청해", "로제 봇요청해", "로 제봇 요청해", "로 제봇요청해", "로제봇 요청합니다", "로제봇요청합니다", "로제 봇 요청합니다", "로제 봇요청합니다", "로 제봇 요청합니다", "로 제봇요청합니다", "로제봇 부탁", "로제봇부탁", "로제 봇 부탁", "로제 봇부탁", "로 제봇 부탁", "로 제봇부탁", "로제봇 도움말", "로제봇도움말", "로제 봇 도움말", "로제 봇도움말", "로 제봇 도움말", "로 제봇도움말", "로제봇 도움을 청해", "로제봇도움을청해", "로제 봇 도움을 청해", "로제 봇도움을 청해", "로 제봇 도움을 청해", "로 제봇도움을 청해", "로제봇 도움을 주세요", "로제봇도움을주세요", "로제 봇 도움을 주세요", "로제 봇도움을 주세요", "로 제봇 도움을 주세요", "로 제봇도움을 주세요", "로제봇 도와줄래", "로제봇도와줄래", "로제 봇 도와줄래", "로제 봇도와줄래", "로 제봇 도와줄래", "로 제봇도와줄래", "로제봇 헬프", "로제봇헬프", "로제 봇 헬프", "로제 봇헬프", "로 제봇 헬프", "로 제봇헬프", "로제봇 도움 요청해", "로제봇도움 요청해", "로제 봇 도움 요청해", "로제 봇도움 요청해", "로 제봇 도움 요청해", "로 제봇도움 요청해"]

## 반차 연차 번호 매칭
VACATION_SEQUENCE_TO_TYPE = ["", "연차", "반차(오전)", "반차(오후)", "반반차(오전)", "반반차(오후)"]
VACATION_SEQUENCE_TO_REASON = ["", "개인휴가", "경조휴가", "특별휴가", "예비군,민방위휴가", "보건휴가", "안식휴가", "출산휴가", "기타휴가"]