docx_generate = ["문서 4종 생성해줘",
  "문서 4종 만들어줘", "4가지 문서 생성해줘", "문서 4종류 만들어 줄래?", "4가지 문서를 만들어줘",
  "문서 네 가지 만들어 줄 수 있어?", "문서 4종 준비해줘", "네 가지 문서를 작성해줘",
  "문서 4종류를 생성할 수 있어?", "4개의 문서 만들어줘", "문서 4종 작성해줘",
  "4개의 다른 문서를 만들어줄래?", "문서 네 종류 만들어봐", "4종류의 문서를 생성해줄 수 있니?",
  "문서 4가지 만들어주세요", "문서 네 개 만들어 줄 수 있니?", "문서 4종류를 작성해줘",
  "4종류 문서 만들기", "4가지 문서를 작성해 줄래?", "문서 네 종류를 준비해줄 수 있어?",
  "문서 4가지 준비해줘"
]
full_rest = [ "연차 신청해줘",
  "연차 사용 신청해줘", "연차 휴가 신청해줘", "연차를 신청해줄래?", "연차 휴가를 사용하고 싶어",
  "연차 사용하고 싶어", "연차 날짜 신청해줘", "연차를 사용할래", "연차 신청하고 싶어",
  "연차 휴가를 신청하고 싶어", "내 연차를 신청해 줄래?", "연차를 내고 싶어", "연차 사용해야 해",
  "연차 휴가 신청할래?", "연차를 사용하고 싶어요", "연차 신청하려고 해", "연차를 사용하고 싶습니다",
  "연차 사용할 수 있을까?", "연차를 내주세요", "연차 휴가 신청하고 싶어요", "연차를 신청할게"
]
half_rest = ["반차 신청해줘",
  "반차 사용 신청해줘", "반차 휴가 신청해줘", "반차를 신청해줄래?", "반차 휴가를 사용하고 싶어",
  "반차 사용하고 싶어", "반차 날짜 신청해줘", "반차를 사용할래", "반차 신청하고 싶어",
  "반차 휴가를 신청하고 싶어", "내 반차를 신청해 줄래?", "반차를 내고 싶어", "반차 사용해야 해",
  "반차 휴가 신청할래?", "반차를 사용하고 싶어요", "반차 신청하려고 해", "반차를 사용하고 싶습니다",
  "반차 사용할 수 있을까?", "반차를 내주세요", "반차 휴가 신청하고 싶어요", "반차를 신청할게"
]
search_db = ["DB 검색해줘",
  "데이터베이스 검색해줘", "DB 조회해줘", "DB에서 정보 찾아줘", "데이터베이스에서 검색해줘",
  "DB에서 데이터 찾아줘", "데이터베이스를 조회해줘", "DB 정보 검색해줘", "데이터베이스 정보 찾아줘",
  "DB 데이터 조회해줘", "DB 검색 부탁해", "데이터베이스 찾아봐줘", "DB에서 정보를 검색해줘",
  "데이터베이스에서 자료 검색해줘", "DB에서 자료 찾아줘", "데이터베이스 정보를 검색해줘",
  "DB를 조회해줘", "데이터베이스를 찾아봐", "DB에서 자료를 찾아줘", "데이터베이스를 검색해줘",
  "DB 자료 검색해줘"
]
one_and_one = ["일대일 미팅 검색해줘",
  "일대일 미팅 조회해줘", "1:1 미팅 검색해줘", "일대일 미팅 찾아줘", "1:1 미팅을 검색해줘",
  "일대일 미팅 예약 찾아줘", "일대일 미팅 스케줄 검색해줘", "1:1 미팅 스케줄을 찾아줘",
  "일대일 미팅을 조회해줘", "1:1 미팅 일정 찾아줘", "일대일 미팅 일정 검색해줘",
  "1:1 미팅 일정을 조회해줘", "일대일 대화 검색해줘", "일대일 미팅 예약을 찾아줘",
  "1:1 대화 검색해줘", "일대일 대화를 찾아줘", "일대일 미팅을 찾아줘",
  "1:1 미팅을 찾아줘", "일대일 미팅 스케줄을 조회해줘", "1:1 미팅 스케줄을 검색해줘",
  "일대일 미팅 예약 검색해줘"
]
authority_change = ["권한 변경해줘"]
view_all_user_authority_list = ["전체 사용자 권한 조회해줘"]
view_updated_user_authority_list = ["권한 변경된 사용자 권한 조회해줘"]
view_my_authority = ["내 권한 알려줘"]
authority_update = ["권한 업데이트해줘"]

## 반차 연차 신청 관련 리스트
vacation_list = ["휴가 신청할래", "휴가", "연차 신청할래"]
## 반차 연차 번호 매칭
VACATION_SEQUENCE_TO_TPYE = ["", "연차", "반차(오전)", "반차(오후)", "반반차(오전)", "반반차(오후)"]
VACATION_SEQUENCE_TO_REASON = ["", "개인휴가", "경조휴가", "특별휴가", "예비군,민방위휴가", "보건휴가", "안식휴가", "출산휴가", "기타휴가"]